samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
        case MAVLINK_MSG_ID_GPS_STATUS: 
            break; 

        case MAVLINK_MSG_ID_GLOBAL_POSITION_INT: 
            break; 

        case MAVLINK_MSG_ID_REQUEST_DATA_STREAM: 
            sik_radio_test_mavlink_request_data_stream(); 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_INT: 
            // Call a separate function to decode mavlink_command_int_t.command 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_LONG: 
            // Call a separate function to decode mavlink_command_long_t.command 
            break; 
        
        default: 
            break; 
    }
}


// MAVLink HEARTBEAT message actions 
void sik_radio_test_mavlink_heartbeat(void)
{
    mavlink_msg_heartbeat_decode(
        &system_data.msg, 
        &system_data.heartbeat_msg); 
    system_data.heartbeat_status_timer = CLEAR; 
    system_data.connected = SET_BIT; 
}


// MAVLink REQUEST_DATA_STREAM message actions 
void sik_radio_test_mavlink_request_data_stream(void)
{
    // Mission Planner sends this message to request data from the autopilot. 
    // When attempting to connect, this message will be sent in rapid succession. 

    mavlink_msg_request_data_stream_decode(
        &system_data.msg, 
        &system_data.request_data_stream_msg); 

    // This message comes with a cooresponding requested message rate. The calculated 
    // timer counter limit is the same calculation for each requested message so it's 
    // done once here and assigned to the requested message. Note that the periodic 
    // interrupt period should be equipped to handle whatever the requested rate is. 
    uint8_t timer_limit = (uint8_t)(S_TO_MS / 
        (system_data.request_data_stream_msg.req_message_rate * SIK_TEST_INT_PERIOD)); 

    // Enable/disable the requested message and assign the message timer counter limit 
    // so it gets sent to the GCS at the requested rate. 
    switch (system_data.request_data_stream_msg.req_stream_id)
    {
        case MAV_DATA_STREAM_RAW_SENSORS: 
            system_data.gps_status_msg_enable = system_data.request_data_stream_msg.start_stop; 
            system_data.gps_status_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTENDED_STATUS: 
            break; 

        case MAV_DATA_STREAM_RC_CHANNELS: 
            break; 

        case MAV_DATA_STREAM_POSITION: 
            system_data.global_pos_int_msg_enable = system_data.request_data_stream_msg.start_stop; 
            system_data.global_pos_int_msg_timer_lim = timer_limit; 
            break; 

        default: 
            break; 
    }

    snprintf((char *)user_data.data_out_buff, 
        SIK_TEST_MSG_BUFF_SIZE, 
        "system: %u, component: %u, stream: %u, rate: %u, start/stop: %u\r\n", 
        system_data.request_data_stream_msg.target_system, 
        system_data.request_data_stream_msg.target_component, 
        system_data.request_data_stream_msg.req_stream_id, 
        system_data.request_data_stream_msg.req_message_rate, 
        system_data.request_data_stream_msg.start_stop); 
    sik_radio_test_user_output((char *)user_data.data_out_buff);    
}

//=======================================================================================


//=======================================================================================
// Periodic actions 

// MAVlink mode periodic actions 
void sik_radio_test_mavlink_periodic(void)
{
    // Everything here is performed periodically when in MAVLink mode. 

    // Check for a connection (heartbeat) timeout 
    if (system_data.heartbeat_status_timer++ >= SIK_TEST_HB_TIMEOUT)
    {
        // Have not seen a heartbeat message from a GCS for too long. The system is 
        // considered to be disconnected. 
        system_data.heartbeat_status_timer--; 
        system_data.connected = CLEAR_BIT; 
    }

    // Check for an AT command mode request timeout 
    if (system_data.at_mode_requested)
    {
        // If AT command mode is being requested then the code waits on the appropriate 
        // response from the radio. Waiting for this response blocks other actions so 
        // once the system has waited too long then cancel the search and return to 
        // normal MAVLink mode. 
        if (system_data.at_mode_request_timer++ >= SIK_TEST_AT_TIMEOUT)
        {
            sik_radio_test_at_request_reset(sik_test_timeout_msg); 
            sik_at_mode(SIK_AT_EXIT); 
        }
    }

    // Check if any of the enabled periodic messages must be sent 
    if (system_data.heartbeat_msg_enable && 
       (++system_data.heartbeat_msg_timer >= system_data.heartbeat_msg_timer_lim))
    {
        system_data.heartbeat_msg_timer = CLEAR; 
        system_data.msg_send = SET_BIT; 

        mavlink_msg_heartbeat_encode(
            system_data.system_id, 
            system_data.component_id, 
            &system_data.msg, 
            &system_data.heartbeat_msg); 
    }
    else if (system_data.global_pos_int_msg_enable && 
            (++system_data.global_pos_int_msg_timer >= system_data.global_pos_int_msg_timer_lim))
    {
        system_data.global_pos_int_msg_timer = CLEAR; 
        system_data.msg_send = SET_BIT; 

        mavlink_msg_global_position_int_encode(
            system_data.system_id, 
            system_data.component_id, 
            &system_data.msg, 
            &system_data.global_pos_int_msg); 
    }
    else if (system_data.gps_status_msg_enable && 
            (++system_data.gps_status_msg_timer >= system_data.gps_status_msg_timer_lim))
    {
        system_data.gps_status_msg_timer = CLEAR; 
        system_data.msg_send = SET_BIT; 

        mavlink_msg_gps_status_encode(
            system_data.system_id, 
            system_data.component_id, 
            &system_data.msg, 
            &system_data.gps_status_msg); 
    }

    if (system_data.msg_send)
    {
        system_data.msg_send = CLEAR_BIT; 
        mavlink_msg_to_send_buffer(radio_data.data_out_buff, &system_data.msg); 
        sik_send_data((char *)radio_data.data_out_buff); 
    }
}

//=======================================================================================


//=======================================================================================
// Helper functions 

// User prompt 
void sik_radio_test_user_output(const char *user_msg)
{
    uart_send_str(user_data.uart, user_msg); 
}


// AT command mode request reset 
void sik_radio_test_at_request_reset(const char *user_msg)
{
    system_data.at_mode_request_timer = CLEAR; 
    system_data.at_mode_requested = CLEAR_BIT; 
    sik_radio_test_user_output(user_msg); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}

//=======================================================================================
